import plotext as plt

'''
a = {'GOOD PROFILE': 47, 'active': 589, 'offline': 566, 'wrong age': 0, 'stopword': 110, 'short descr': 377, 'bad name': 0, 'short name': 7, 'too far': 3}
b = {'@': 11, 'свидани': 2, 'девушк': 2, 'inst': 15, 'ценю': 4, 'сериал': 3, 'общени': 7, 'выше': 1, 'не люблю': 2, 'предложен': 1, 'сын': 4, 'переписки': 2, 'приоритет': 1, 'психолог': 5, 'ответственн': 1, 'instagram': 4, 'не ищу': 2, 'развитие': 4, '!!!': 3, 'влюбиться': 2, 'рост': 5, 'цветы': 2, 'эзотерик': 1, 'душн': 2, 'псих': 1, 'инстаграм': 1, 'развиваться': 1, 'ребенок': 2, 'адекват': 2, 'одноразовы': 1, 'выношу мозг': 1, 'прошу': 1, 'модель': 1, 'ухажива': 1, 'развод': 1, 'собак': 1, 'вредная': 1, 'инст:': 1, 'характер': 1, 'серьёзные отношения': 1, 'цветов': 1, 'знакомств': 1, 'если ты': 1, 'гештальт': 1, 'мама': 1, 'дочк': 1}



a={'GOOD PROFILE': 48, 'active': 781, 'offline': 690, 'wrong age': 0, 'stopword': 153, 'short descr': 512, 'bad name': 2, 'short name': 12, 'too far': 0}
b={'inst': 23, 'психолог': 11, '@': 15, 'инстаграм': 3, 'знакомств': 1, 'инст:': 3, 'душн': 2, 'рост': 13, 'развитие': 2, 'инста': 1, 'ценю': 7, 'переписки': 1, 'instagram': 5, 'общени': 5, 'научи': 2, 'девушк': 2, 'не люблю': 9, 'свидани': 3, 'сериал': 6, 'сын': 3, 'адекват': 7, 'ответственн': 1, 'собак': 1, 'дочк': 2, 'влюбиться': 1, 'руководител': 1, 'ухажива': 1, 'развод': 3, 'хам': 1, 'приветствуется': 2, 'предложен': 2, 'зануд': 1, 'консультант': 1, 'скучн': 1, '!!!': 1, 'выше': 1, 'психоанали': 1, 'мужчины': 1, 'не ищу': 2, 'высок': 3, 'если ты': 1, 'ребёнок': 1}




{'GOOD PROFILE': 25, 'active': 436, 'offline': 500, 'wrong age': 0, 'stopword': 81, 'short descr': 281, 'bad name': 6, 'short name': 10, 'too far': 1}
{'психолог': 13, 'не отвечаю': 2, '@': 8, 'развиваться': 2, 'девушк': 2, 'не люблю': 4, 'сериал': 2, 'inst': 8, 'ценю': 6, 'руководител': 1, 'знакомств': 1, 'instagram': 2, 'свидани': 2, 'серьёзные отношения': 2, 'щедр': 1, 'душн': 1, 'общени': 3, 'вредн': 2, 'консультант': 1, 'если ты': 2, 'развод': 1, 'поступки': 1, 'ответственн': 1, 'рост': 2, 'влюбиться': 1, 'развитие': 1, 'инст:': 1, 'не ищу': 1, 'мужчины': 1, 'собак': 1, 'характер': 1, '!!': 1, 'мужик': 1, 'заботлив': 1, 'переписки': 1}


PART 2 SINCE 15:58
'''

'''

a={'GOOD PROFILE': 20, 'active': 362, 'offline': 554, 'wrong age': 0, 'stopword': 75, 'short descr': 247, 'bad name': 0, 'short name': 6, 'too far': 0}
b={'@': 6, 'рост': 5, 'сериал': 1, 'мужчины': 1, 'собак': 1, 'не люблю': 8, 'психолог': 3, 'общени': 4, 'instagram': 2, 'ценю': 2, 'одноразовы': 1, 'выше': 1, 'как дела': 1, 'inst': 7, 'мужчина должен': 1, 'цветы': 1, 'адекват': 3, 'ответственн': 2, 'мама': 1, 'знакомств': 2, 'просьба': 1, 'научи': 1, 'ребенок': 1, 'развитие': 2, 'заботлив': 1, 'ухажива': 1, 'дочк': 1, 'скучн': 1, '!!!': 1, 'консультант': 1, 'http': 1, 'сын': 1, 'высок': 1, 'девушк': 3, 'развод': 2, 'гештальт': 1, 'свидани': 1, 'не пишу': 1}

  start 10:45 - 12:55
{'GOOD PROFILE': 13, 'active': 205, 'offline': 197, 'wrong age': 0, 'stopword': 38, 'short descr': 141, 'bad name': 1, 'short name': 2, 'too far': 4}
{'инст:': 1, 'собак': 1, 'не люблю': 1, 'психолог': 1, 'инста': 2, 'научи': 1, 'инстаграм': 1, 'inst': 5, 'заботлив': 1, 'развитие': 1, 'рост': 1, 'адекват': 2, 'сериал': 1, '@': 1, 'переписки': 1, 'щедр': 1, 'ценю': 1, 'общени': 1, 'цветы': 1, 'instagram': 4, 'свидани': 2, 'серьёзные отношения': 2, 'дочь': 1, 'руководител': 1, 'влюбиться': 1, 'сын': 1, 'ребенок': 1}
'''

a={'GOOD PROFILE': 34, 'active': 442, 'offline': 548, 'wrong age': 0, 'stopword': 78, 'short descr': 297, 'bad name': 0, 'short name': 8, 'too far': 0}
b={'сериал': 2, '@': 5, 'переписки': 1, 'начальн': 1, 'inst': 7, 'знакомств': 3, 'instagram': 2, 'душн': 1, 'руководител': 1, 'психолог': 2, 'адекват': 1, 'инстаграм': 1, 'собак': 1, 'зануд': 1, 'рост': 1, 'мужчины': 1, 'девушк': 1}





def plot_horizontal_barchart(data, title=""):
    categories, values = zip(*data.items())

    plt.bar(categories, values, orientation="vertical") # width=3 / 5
    plt.title(title)
    plt.show()

#plot_horizontal_barchart(a)
plot_horizontal_barchart( {key: value for key, value in sorted(b.items(), key=lambda item: item[1], reverse=False)} )



